#!/usr/bin/env python3
# -*- coding: utf-8 -*-
"""
BioFrog v2.0 - INTERACTIVE MAIN MENU
A biological neural network frog hunting simulation
"""

import sys
import time
from pathlib import Path

# Убедитесь, что мы в корректной директории
PROJECT_ROOT = Path(__file__).parent.absolute()
sys.path.insert(0, str(PROJECT_ROOT))

try:
    from frog_lib import FlyCatchingSimulation, BioFrogAgent
    print("\n✅ Пакет frog_lib успешно загружен!")
except ImportError as e:
    print(f"\n❌ Ошибка импорта: {e}")
    print("Убедитесь, что вы запускаете скрипт из корневой папки проекта")
    sys.exit(1)


def print_header():
    """Вывести красивый заголовок"""
    print("\n" + "="*80)
    print("╔════════════════════════════════════════════════════════════════════════════╗")
    print("║                   🐸 BioFrog v2.0 - Главное Меню 🐸                       ║")
    print("║                                                                            ║")
    print("║  Биологически достоверный фрог-охотник с реальной нейросетью              ║")
    print("╚════════════════════════════════════════════════════════════════════════════╝")
    print("="*80 + "\n")


def option_1_full_simulation():
    """ОПЦИЯ 1: Полная симуляция с визуализацией"""
    print("\n" + "─"*80)
    print("🎮 ПОЛНАЯ СИМУЛЯЦИЯ С ВИЗУАЛИЗАЦИЕЙ")
    print("─"*80)
    print("""
Параметры:
  • Размер экрана: 800×600 px
  • Мух: 20
  • Режим: Автоматический (сначала детство, потом взрослость)
  • Обучение: Активно (STDP + дофамин)
  • Длительность: ~2-3 минуты
  
Управление:
  • SPACE - пауза/возобновление
  • Q - выход
  • R - сброс
    """)

    input("Нажмите ENTER для запуска...")
    
    try:
        sim = BioFlyCatchingSimulation(
            width=800,
            height=600,
            num_flies=20,
            use_visualization=True
        )
        print("\n🚀 Запуск полной симуляции...\n")
        sim.run_simulation(5000)  # Полный цикл обучения
        
        print("\n✅ Симуляция завершена!")
        print(f"Всего поймано мух: {sim.stats['caught_flies']}")
        print(f"Успешность: {sim.stats['catch_success_rate']*100:.1f}%")
        
    except Exception as e:
        print(f"\n❌ Ошибка при запуске: {e}")


def option_2_quick_test():
    """ОПЦИЯ 2: Быстрый тест (без визуализации)"""
    print("\n" + "─"*80)
    print("⚡ БЫСТРЫЙ ТЕСТ БЕЗ ВИЗУАЛИЗАЦИИ")
    print("─"*80)
    print("""
Параметры:
  • Мух: 10
  • Шагов: 500 (быстро!)
  • Визуализация: Отключена
  • Длительность: ~5 секунд
    """)

    input("Нажмите ENTER для запуска...")
    
    try:
        sim = BioFlyCatchingSimulation(
            width=400,
            height=300,
            num_flies=10,
            use_visualization=False
        )
        print("\n⏱️ Запуск (это займёт ~5 секунд)...\n")
        sim.run_simulation(500)
        
        print("\n✅ Тест завершён!")
        print(f"Поймано мух: {sim.stats['caught_flies']}")
        print(f"Успешность: {sim.stats['catch_success_rate']*100:.1f}%")
        print(f"Средняя энергия: {sim.stats['avg_energy']:.2f}")
        print(f"Средний дофамин: {sim.stats['avg_dopamine']:.2f}")
        
    except Exception as e:
        print(f"\n❌ Ошибка: {e}")


def option_3_juvenile_mode():
    """ОПЦИЯ 3: Режим детства (с высоким дофамином)"""
    print("\n" + "─"*80)
    print("👶 РЕЖИМ ДЕТСТВА (ИНТЕНСИВНОЕ ОБУЧЕНИЕ)")
    print("─"*80)
    print("""
В режиме детства:
  • Дофамин = 0.85 (максимум!) - сильное подкрепление
  • STDP обучение максимально активно
  • Мозг быстро учится ловить мух
  • Это критический период развития
  
Параметры:
  • Мух: 15
  • Шагов: 3000 (интенсивное обучение)
  • С визуализацией: ДА
    """)

    input("Нажмите ENTER для запуска...")
    
    try:
        sim = BioFlyCatchingSimulation(
            width=800,
            height=600,
            num_flies=15,
            use_visualization=True
        )
        sim.juvenile_mode = True
        
        print("\n👶 Запуск режима детства...\n")
        sim.run_simulation(3000)
        
        print("\n✅ Детство завершено!")
        print(f"Обучено хватать мух: {sim.stats['caught_flies']}")
        print(f"Успешность в конце: {sim.stats['catch_success_rate']*100:.1f}%")
        
    except Exception as e:
        print(f"\n❌ Ошибка: {e}")


def option_4_adult_mode():
    """ОПЦИЯ 4: Режим взрослого фрога"""
    print("\n" + "─"*80)
    print("🐸 РЕЖИМ ВЗРОСЛОГО ФРОГА (СТАБИЛИЗИРОВАННОЕ ПОВЕДЕНИЕ)")
    print("─"*80)
    print("""
В режиме взрослого:
  • Дофамин = 0.3 (нормально) - слабое подкрепление
  • STDP обучение замедлено (консолидация)
  • Поведение стабилизировано
  • Синапсы защищены от переобучения
  
Параметры:
  • Мух: 15
  • Шагов: 2000
  • С визуализацией: ДА
    """)

    input("Нажмите ENTER для запуска...")
    
    try:
        sim = BioFlyCatchingSimulation(
            width=800,
            height=600,
            num_flies=15,
            use_visualization=True
        )
        sim.juvenile_mode = False  # Взрослый режим
        
        print("\n🐸 Запуск режима взрослого...\n")
        sim.run_simulation(2000)
        
        print("\n✅ Симуляция завершена!")
        print(f"Поймано мух: {sim.stats['caught_flies']}")
        print(f"Успешность: {sim.stats['catch_success_rate']*100:.1f}%")
        
    except Exception as e:
        print(f"\n❌ Ошибка: {e}")


def option_5_components_info():
    """ОПЦИЯ 5: Информация о компонентах"""
    print("\n" + "─"*80)
    print("📚 ИНФОРМАЦИЯ О КОМПОНЕНТАХ")
    print("─"*80)
    print("""
BioFrog v2.0 состоит из 11 биологических компонентов:

🧠 CORE (Ядро):
  • LIFNeuron - интегрирующий и запускающийся нейрон
  • BiologicalSynapse - синапс с STDP обучением
  • Astrocyte - глиальные клетки (модуляция)
  • NeurotransmitterDiffusion - нейромедиаторы

👁️ ARCHITECTURE (Архитектура):
  • RetinalProcessing - обработка светочувствительности (ON/OFF)
  • Tectum - обнаружение движения (4 направления)
  • MotorHierarchy - иерархический контроль движения

⚡ METABOLISM (Метаболизм):
  • SystemicMetabolism - энергия и внимание
  • Circadian - суточные ритмы (не активно днём)

🔄 PLASTICITY (Пластичность):
  • FunctionalPlasticity - гомеостаз и компенсация
  • StructuralPlasticity - создание/удаление синапсов

📊 Все компоненты работают вместе, образуя реалистичный мозг!
    """)

    input("Нажмите ENTER для возврата в меню...")


def option_6_diagnostics():
    """ОПЦИЯ 6: Диагностика проекта"""
    print("\n" + "─"*80)
    print("🔧 ДИАГНОСТИКА")
    print("─"*80)
    
    try:
        from frog_lib import (
            BioFrogBrain, LIFNeuron, BiologicalSynapse,
            RetinalProcessing, Tectum, MotorHierarchy,
            SystemicMetabolism, FunctionalPlasticityManager,
            StructuralPlasticityManager
        )
        
        print("\n✅ ВСЕ КОМПОНЕНТЫ УСПЕШНО ЗАГРУЖЕНЫ:\n")
        
        components = [
            ("BioFrogBrain", "Главный контроллер"),
            ("LIFNeuron", "Модель нейрона"),
            ("BiologicalSynapse", "Синаптическая пластичность"),
            ("RetinalProcessing", "Зрительная система"),
            ("Tectum", "Детектор движения"),
            ("MotorHierarchy", "Контроль движения"),
            ("SystemicMetabolism", "Энергетика"),
            ("FunctionalPlasticityManager", "Гомеостаз"),
            ("StructuralPlasticityManager", "Синаптическая структура"),
        ]
        
        for comp_name, comp_desc in components:
            print(f"  ✓ {comp_name:<30} - {comp_desc}")
        
        print("\n✅ ДИАГНОСТИКА УСПЕШНА!")
        print("   Все системы готовы к работе")
        
    except Exception as e:
        print(f"❌ ОШИБКА: {e}")
    
    input("\nНажмите ENTER для возврата в меню...")


def option_7_docs():
    """ОПЦИЯ 7: Справка по документации"""
    print("\n" + "─"*80)
    print("📖 ДОКУМЕНТАЦИЯ")
    print("─"*80)
    print("""
Основные документы проекта:

📄 DEBUG_REPORT.md
   - Полный диагностический отчёт
   - Объяснение ошибок и решений
   - Правильные способы запуска

📄 PROJECT_STRUCTURE.md
   - Структура проекта
   - Описание каждого модуля
   - Архитектура нейросети

📄 QUICK_START.py
   - Примеры кода для начинающих
   - Как использовать frog_lib в своём коде

📄 RESTRUCTURING_COMPLETE.md
   - История реструктуризации
   - Что было изменено и почему

📄 README_COMPLETE.md
   - Общая информация о BioFrog
   - Биологические основы
   - Результаты тестирования

🖥️ Запустите эти файлы:
   - python run_simulation.py     (полная симуляция)
   - python run_biofrog_examples.py (4 примера)
   - python test_biofrog.py       (быстрый тест)
    """)
    
    input("Нажмите ENTER для возврата в меню...")


def main_menu():
    """Главное меню"""
    while True:
        print_header()
        
        print("""
┌─────────────────────────────────────────────────────────────┐
│                       ДОСТУПНЫЕ ОПЦИИ                       │
├─────────────────────────────────────────────────────────────┤
│  1️⃣  Полная симуляция с визуализацией (800×600, 5000 шаг)  │
│  2️⃣  Быстрый тест без визуализации (500 шагов, ~5 сек)    │
│  3️⃣  Режим детства - интенсивное обучение (👶 0.85 допамин)│
│  4️⃣  Режим взрослого - стабилизация (🐸 0.3 допамин)       │
│  5️⃣  Информация о компонентах мозга                        │
│  6️⃣  Диагностика проекта (проверка всех систем)           │
│  7️⃣  Справка по документации                               │
│  0️⃣  Выход                                                 │
└─────────────────────────────────────────────────────────────┘
        """)
        
        choice = input("Выберите опцию (0-7): ").strip()
        
        if choice == "1":
            option_1_full_simulation()
        elif choice == "2":
            option_2_quick_test()
        elif choice == "3":
            option_3_juvenile_mode()
        elif choice == "4":
            option_4_adult_mode()
        elif choice == "5":
            option_5_components_info()
        elif choice == "6":
            option_6_diagnostics()
        elif choice == "7":
            option_7_docs()
        elif choice == "0":
            print("\n👋 До свидания!")
            sys.exit(0)
        else:
            print("\n❌ Неверная опция. Попробуйте снова.")
            time.sleep(1)


if __name__ == "__main__":
    try:
        main_menu()
    except KeyboardInterrupt:
        print("\n\n👋 Прервано пользователем. До свидания!")
        sys.exit(0)
    except Exception as e:
        print(f"\n❌ Критическая ошибка: {e}")
        import traceback
        traceback.print_exc()
        sys.exit(1)
